# Relatorio de analises V

## Tirando valores nulos

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel_residencial.csv',sep =';')

In [13]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

In [6]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22845 entries, 0 to 22844
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22845 non-null  object
 1   Bairro      22845 non-null  object
 2   Quartos     22845 non-null  int64
 3   Vagas       22845 non-null  int64
 4   Suites      22845 non-null  int64
 5   Area        22845 non-null  int64
 6   Valor       22836 non-null  float64
 7   Condominio  20796 non-null  float64
 8   IPTU        15976 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.6+ MB

### Tratando valores nulos

In [10]:
dados[dados['Valor'].isnull()]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
58,Apartamento,Barra da Tijuca,2,1,1,70,NaN,970.0,68.0
1515,Apartamento,Leme,2,0,0,75,NaN,878.0,NaN
1708,Casa,Campo Grande,3,4,3,363,NaN,NaN,NaN
2039,Apartamento,Botafogo,2,0,0,95,NaN,1010.0,170.0
2061,Apartamento,Copacabana,2,0,0,72,NaN,850.0,NaN
4998,Casa,Campo Grande,3,2,1,100,NaN,NaN,NaN
8674,Apartamento,Leme,2,0,1,75,NaN,878.0,NaN
9061,Apartamento,Glória,3,0,1,135,NaN,910.0,228.0
9264,Apartamento,Gávea,3,1,1,105,NaN,880.0,221.0

In [11]:
A = dados.shape[0]
dados.dropna(subset = ['Valor'],inplace = True)
B = dados.shape[0]
A - B

9

In [12]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [14]:
# Se o imóvel for do tipo apartamento ele deve conter o campo condomínio

In [16]:
dados[dados['Condominio'].isnull()].shape[0]

2047

In [18]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [19]:
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A - B

745

In [20]:
dados[dados['Condominio'].isnull()].shape[0]

1302

In [23]:
dados = dados.fillna({'Condominio':0,'IPTU':0})

In [24]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [25]:
dados[dados['IPTU'].isnull()].shape[0]

0

In [26]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22091 entries, 0 to 22844
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22091 non-null  object
 1   Bairro      22091 non-null  object
 2   Quartos     22091 non-null  int64
 3   Vagas       22091 non-null  int64
 4   Suites      22091 non-null  int64
 5   Area        22091 non-null  int64
 6   Valor       22091 non-null  float64
 7   Condominio  22091 non-null  float64
 8   IPTU        22091 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [27]:
dados.to_csv('dados/aluguel_residencial.csv',sep =';',index = False)